IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2
Exposure Classes Ec2

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.#ctor
Constructor

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.NoCorrosionCheck
Check box No corrosion

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.CarbonationCheck
Check box Carbonation

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.Carbonation
Combo box Carbonation

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.ChloridesCheck
Check box Chlorides

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.Chlorides
Combo box Chlorides

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.ChloridesFromSeaCheck
Check box Chlorides from sea

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.ChloridesFromSea
Combo box Chlorides from sea

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.FreezeAttackCheck
Check box Freeze/Thaw Attack

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.FreezeAttack
Combo box Freeze/Thaw Attack

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.ChemicalAttackCheck
Check box Chemical Attack

IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2.ChemicalAttack
Combo box Chemical Attack